episode_11_demo_2/app/views/rooms/_last_message.html.erb

      <em class="last-message"><%= "#{last_message.user.email} sent a message".truncate(40) %></em>
      <em class="last-message"><%= "#{time_ago_in_words(last_message.created_at)} ago"%></em>
---
INSERT INTO "messages" ("user_id", "room_id", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["room_id", 2], ["body", "test"], ["created_at", "2022-03-25 06:43:34.535730"], ["updated_at", "2022-03-25 06:43:34.535730"]]