episode_11_demo_2/app/models/message.rb

  def confirm_participant
    return unless room.is_private

    is_participant = Participant.where(user_id: user.id, room_id: room.id).first
---
SELECT "participants".* FROM "participants" WHERE "participants"."user_id" = $1 AND "participants"."room_id" = $2 ORDER BY "participants"."id" ASC LIMIT $3  [["user_id", 1], ["room_id", 4], ["LIMIT", 1]]

  def update_parent_room
    room.update(last_message_at: Time.now)
---
UPDATE "rooms" SET "updated_at" = $1, "last_message_at" = $2 WHERE "rooms"."id" = $3  [["updated_at", "2022-03-25 06:27:11.683907"], ["last_message_at", "2022-03-25 06:27:11.678530"], ["id", 2]]