episode_11_demo_2/app/models/room.rb

  def participant?(room, user)
    room.participants.where(user: user).exists?
---
SELECT 1 AS one FROM "participants" WHERE "participants"."room_id" = $1 AND "participants"."user_id" = $2 LIMIT $3  [["room_id", 1], ["user_id", 2], ["LIMIT", 1]]