episode_6/app/controllers/rooms_controller.rb

SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "messages".* FROM "messages" WHERE "messages"."room_id" = ? ORDER BY "messages"."created_at" ASC  [["room_id", 4]]
---
  def show
    @single_room = Room.find(params[:id])

    @room = Room.new
    @rooms = Room.public_rooms

    @message = Message.new
    @messages = @single_room.messages.order(created_at: :asc)

INSERT INTO "rooms" ("name", "is_private", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Fifth Wall"], ["is_private", 0], ["created_at", "2022-01-28 08:06:16.614099"], ["updated_at", "2022-01-28 08:06:16.614099"]]
---
  def create
    @room = Room.create(name: params['room']['name'])

UPDATE "users" SET "updated_at" = ?, "status" = ? WHERE "users"."id" = ?  [["updated_at", "2022-02-18 08:54:27.194846"], ["status", 2], ["id", 1]]
---
  def set_status
    current_user.update!(status: User.statuses[:online]) if current_user