episode_1/app/controllers/messages_controller.rb

INSERT INTO "messages" ("user_id", "room_id", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["room_id", 4], ["body", "Hello world!"], ["created_at", "2022-01-24 08:54:50.913977"], ["updated_at", "2022-01-24 08:54:50.913977"]]
---
    def create
        @message = current_user.messages.create(body: msg_params[:body], room_id: params[:room_id])