episode_11_demo_2/app/controllers/rooms_controller.rb

  def index
    @room = Room.new
    @joined_rooms = current_user.joined_rooms.order('last_message_at DESC')
---
SELECT "rooms".* FROM "rooms" INNER JOIN "joinables" ON "rooms"."id" = "joinables"."room_id" WHERE "joinables"."user_id" = $1 ORDER BY last_message_at DESC  [["user_id", 1]]

  def show
    @single_room = Room.find(params[:id])

    @room = Room.new
    @rooms = search_rooms
    @joined_rooms = current_user.joined_rooms.order('last_message_at DESC')

    @message = Message.new

    pagy_messages = @single_room.messages.includes(:user).order(created_at: :desc)
---
SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "rooms".* FROM "rooms" INNER JOIN "joinables" ON "rooms"."id" = "joinables"."room_id" WHERE "joinables"."user_id" = $1 ORDER BY last_message_at DESC  [["user_id", 1]]
SELECT "messages".* FROM "messages" WHERE "messages"."room_id" = $1 ORDER BY "messages"."created_at" DESC LIMIT $2  [["room_id", 2], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" IN ($1, $2)  [["id", 2], ["id", 1]]

  def create
    @room = Room.create(name: params['room']['name'])
---
INSERT INTO "rooms" ("name", "is_private", "created_at", "updated_at", "last_message_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "YouTube"], ["is_private", false], ["created_at", "2022-03-25 08:18:27.531735"], ["updated_at", "2022-03-25 08:18:27.531735"], ["last_message_at", nil]]

  def join
    @room = Room.find(params[:id])
---
SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def leave
    @room = Room.find(params[:id])
---
SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def set_status
    current_user.update!(status: User.statuses[:online]) if current_user
---
UPDATE "users" SET "updated_at" = $1, "status" = $2 WHERE "users"."id" = $3  [["updated_at", "2022-03-18 06:42:56.700648"], ["status", 2], ["id", 1]]