temp10/app/controllers/rooms_controller.rb

  def show
    @single_room = Room.find(params[:id])

    @room = Room.new
    @rooms = search_rooms
    @joined_rooms = current_user.joined_rooms

    @message = Message.new

    pagy_messages = @single_room.messages.includes(:user).order(created_at: :desc)
---
SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" IN ($1, $2)  [["id", 2], ["id", 1]]

  def create
    @room = Room.create(name: params['room']['name'])
---
INSERT INTO "rooms" ("name", "is_private", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Content Creators"], ["is_private", false], ["created_at", "2022-03-18 06:42:05.562023"], ["updated_at", "2022-03-18 06:42:05.562023"]]

  def join
    @room = Room.find(params[:id])
---
SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def leave
    @room = Room.find(params[:id])
---
SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def set_status
    current_user.update!(status: User.statuses[:online]) if current_user
---
UPDATE "users" SET "updated_at" = $1, "status" = $2 WHERE "users"."id" = $3  [["updated_at", "2022-03-18 06:42:56.700648"], ["status", 2], ["id", 1]]