episode_4_demo/app/controllers/users/sessions_controller.rb

  def create
    super
    current_user.update(status: User.statuses[:online])
---
UPDATE "users" SET "updated_at" = ?, "status" = ? WHERE "users"."id" = ?  [["updated_at", "2022-02-18 01:08:47.120050"], ["status", 2], ["id", 2]]