episode_3_demo/app/views/messages/_message.html.erb

INSERT INTO "messages" ("user_id", "room_id", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["room_id", 4], ["body", "Hello world!"], ["created_at", "2022-01-24 08:54:50.913977"], ["updated_at", "2022-01-24 08:54:50.913977"]]
---
        <h6 class="name"><%= message.user.email %></h6>
        <p class="time"><%= time_ago_in_words(message.created_at) %> ago</p>