episode_26_demo/app/controllers/rooms_controller.rb

  def index
    @room = Room.new
    @joined_rooms = current_user.joined_rooms.order('last_message_at DESC')
    @rooms = search_rooms
    current_user.update(current_room: nil)
---
SELECT "rooms".* FROM "rooms" INNER JOIN "joinables" ON "rooms"."id" = "joinables"."room_id" WHERE "joinables"."user_id" = $1 ORDER BY last_message_at DESC  [["user_id", 1]]
UPDATE "users" SET "updated_at" = $1, "status" = $2 WHERE "users"."id" = $3  [["updated_at", "2022-07-15 07:48:09.466883"], ["status", 2], ["id", 1]]

  def show
    @single_room = Room.find(params[:id])
    current_user.update(current_room: @single_room)

    @room = Room.new
    @rooms = search_rooms
    @joined_rooms = current_user.joined_rooms.order('last_message_at DESC')

    @message = Message.new

    pagy_messages = @single_room.messages.includes(:user).order(created_at: :desc)
---
SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = $1, "status" = $2 WHERE "users"."id" = $3  [["updated_at", "2022-07-15 07:28:40.009271"], ["status", 2], ["id", 2]]
SELECT "rooms".* FROM "rooms" INNER JOIN "joinables" ON "rooms"."id" = "joinables"."room_id" WHERE "joinables"."user_id" = $1 ORDER BY last_message_at DESC  [["user_id", 2]]
SELECT "messages".* FROM "messages" WHERE "messages"."room_id" = $1 ORDER BY "messages"."created_at" DESC LIMIT $2  [["room_id", 3], ["LIMIT", 1]]

  def create
    @room = Room.create(name: params['room']['name'])
---
INSERT INTO "rooms" ("name", "is_private", "created_at", "updated_at", "last_message_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", ""], ["is_private", false], ["created_at", "2022-07-15 07:48:22.137909"], ["updated_at", "2022-07-15 07:48:22.137909"], ["last_message_at", nil]]

  def set_status
    return if current_user.status == User.statuses[:dnd]

    current_user.update!(status: User.statuses[:online]) if current_user
---
UPDATE "users" SET "updated_at" = $1, "status" = $2 WHERE "users"."id" = $3  [["updated_at", "2022-07-15 07:48:09.466883"], ["status", 2], ["id", 1]]

  def set_notifications_to_read
    notifications = @single_room.notifications_as_room.where(recipient: current_user).unread
    notifications.update_all(read_at: Time.zone.now)
---
UPDATE "notifications" SET "read_at" = $1 WHERE (params @> '{"room":{"_aj_globalid":"gid://turbochat/Room/5"},"_aj_symbol_keys":["room"]}') AND "notifications"."recipient_type" = $2 AND "notifications"."recipient_id" = $3 AND "notifications"."read_at" IS NULL  [["read_at", "2022-07-15 07:48:22.193995"], ["recipient_type", "User"], ["recipient_id", 1]]