episode_4/app/models/room.rb

  def self.create_private_room(users, room_name)
    single_room = Room.create(name: room_name, is_private: true)
    users.each do |user|
      Participant.create(user_id: user.id, room_id: single_room.id)
---
INSERT INTO "rooms" ("name", "is_private", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "private_1_2"], ["is_private", 1], ["created_at", "2022-01-28 08:09:53.698428"], ["updated_at", "2022-01-28 08:09:53.698428"]]
INSERT INTO "participants" ("user_id", "room_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 2], ["room_id", 6], ["created_at", "2022-01-28 08:09:53.738865"], ["updated_at", "2022-01-28 08:09:53.738865"]]

  def participant?(room, user)
    room.participants.where(user: user).exists?
    Participant.where(user_id: user.id, room_id: room.id).exists?
---
SELECT 1 AS one FROM "participants" WHERE "participants"."room_id" = ? AND "participants"."user_id" = ? LIMIT ?  [["room_id", 3], ["user_id", 2], ["LIMIT", 1]]
SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
SELECT 1 AS one FROM "participants" WHERE "participants"."user_id" = ? AND "participants"."room_id" = ? LIMIT ?  [["user_id", 2], ["room_id", 3], ["LIMIT", 1]]