episode_4_demo/app/channels/appearance_channel.rb

  def broadcast_new_status(_status)
    current_user.update(status: _status)
---
UPDATE "users" SET "updated_at" = ?, "status" = ? WHERE "users"."id" = ?  [["updated_at", "2022-02-18 01:07:25.305034"], ["status", 2], ["id", 2]]