episode_26_demo/app/controllers/concerns/MessageParser.rb

UPDATE "users" SET "updated_at" = $1, "status" = $2 WHERE "users"."id" = $3  [["updated_at", "2022-07-15 08:03:46.013124"], ["status", 3], ["id", 2]]
UPDATE "users" SET "updated_at" = $1, "status" = $2 WHERE "users"."id" = $3  [["updated_at", "2022-07-15 08:03:49.018286"], ["status", 1], ["id", 2]]
UPDATE "users" SET "updated_at" = $1, "status" = $2 WHERE "users"."id" = $3  [["updated_at", "2022-07-15 08:04:22.552648"], ["status", 2], ["id", 2]]
---
  def status_manager(command)
    case command[0]
    when @dnd
      new_status = current_user.dnd? ? User.statuses[:online] : User.statuses[:dnd]
      current_user.update(status: new_status)
    when @away
      new_status = current_user.away? ? User.statuses[:online] : User.statuses[:away]
      current_user.update(status: new_status)
    when @offline
      current_user.update(status: User.statuses[:offline])
    when @online
      current_user.update(status: User.statuses[:online])