episode_26_demo/app/channels/appearance_channel.rb

  def broadcast_new_status(status)
    target_user = User.find_by(id: current_user.id)

    current_user.update(status:) unless target_user.dnd?
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = $1, "status" = $2 WHERE "users"."id" = $3  [["updated_at", "2022-07-15 07:44:13.092814"], ["status", 2], ["id", 2]]